Revit 2026 API

# ControlledApplicationActiveAddInId Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AddInId ActiveAddInId { get; }
```
```vb
Public ReadOnly Property ActiveAddInId As AddInId
	Get
```
```cpp
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
```
```fsharp
member ActiveAddInId : AddInId with get
```

#### Property Value

AddInId

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace